#### 0. pandas 패키지 import

In [46]:
import pandas as pd

In [3]:
# pandas -> 표 형태의 데이터를 다루는데 특화된 도구
# 데이터를 색인하는 index 개념을 행과 열에 따라 다른 명칭을 부여함
# 행을 색인하는 인덱스 -> index
# 열을 색인하는 인덱스 -> columns
# 1차원 데이터를 표현하는 클래스 -> Series
# 2차원 데이터를 표현하는 클래스 -> DataFrame

#### 1. Series 생성

In [4]:
# Series 생성
h = pd.Series([179, 165, 140, 158, 192])
h
#출력:
# 0    179
# 1    165
# 2    140
# 3    158
# 4    192
# dtype: int64

0    179
1    165
2    140
3    158
4    192
dtype: int64

In [5]:
#글자 인덱스 부여해서  Series 생성
w = pd.Series([60,58,81,77,47], index = ["선영표","정봉균","황해도",
                                        "박병관", "정형"])
w
#출력:
# 선영표    60
# 정봉균    58
# 황해도    81
# 박병관    77
# 정형     47
# dtype: int64

선영표    60
정봉균    58
황해도    81
박병관    77
정형     47
dtype: int64

In [6]:
# 이름을 부여해서 Series 생성
w = pd.Series([60,58,81,77,47], index = ["선영표","정봉균","황해도",
                                        "박병관", "정형"], name="몸무게")
w
#출력:
# 선영표    60
# 정봉균    58
# 황해도    81
# 박병관    77
# 정형     47
# Name: 몸무게, dtype: int64

선영표    60
정봉균    58
황해도    81
박병관    77
정형     47
Name: 몸무게, dtype: int64

In [7]:
# 속성 활용하기
display(w.shape) # 모양 확인 #출력:(5,)
display(w.values) #값을 꺼내고 싶은 경우  #출력:array([60, 58, 81, 77, 47], dtype=int64)
display(w.index) #인덱스만 꺼내고 싶은 경우 #출력:Index(['선영표', '정봉균', '황해도', '박병관', '정형'], dtype='object')
display(w.dtype) #데이터 타입을 알고 싶은 경우 #출력:dtype('int64')

(5,)

array([60, 58, 81, 77, 47], dtype=int64)

Index(['선영표', '정봉균', '황해도', '박병관', '정형'], dtype='object')

dtype('int64')

In [8]:
#연산->같은 인덱스끼리 요소별 연산지원
# 같은 인덱스가 없는 경우 연산할 수 없어 NaN 발생
w / (h ** 2)
#출력:
# 0     NaN
# 1     NaN
# 2     NaN
# 3     NaN
# 4     NaN
# 박병관   NaN
# 선영표   NaN
# 정봉균   NaN
# 정형    NaN
# 황해도   NaN
# dtype: float64

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
박병관   NaN
선영표   NaN
정봉균   NaN
정형    NaN
황해도   NaN
dtype: float64

In [9]:
#키 데이터(h)에 인덱스를 부여
h.index = ["선영표","정봉균","황해도","박병관", "정형"]
#자 : 이미 생성된 시리즈 객체면 속성으로 접근

h

#출력:
# 선영표    179
# 정봉균    165
# 황해도    140
# 박병관    158
# 정형     192
# dtype: int64

선영표    179
정봉균    165
황해도    140
박병관    158
정형     192
dtype: int64

In [10]:
# cm-> m 단위로 변경 후 계산
w / ((h/100) ** 2)
#출력:
# 선영표    18.726007
# 정봉균    21.303949
# 황해도    41.326531
# 박병관    30.844416
# 정형     12.749566
# dtype: float64

선영표    18.726007
정봉균    21.303949
황해도    41.326531
박병관    30.844416
정형     12.749566
dtype: float64

In [11]:
h/100
#출력
# 선영표    1.79
# 정봉균    1.65
# 황해도    1.40
# 박병관    1.58
# 정형     1.92
# dtype: float64

선영표    1.79
정봉균    1.65
황해도    1.40
박병관    1.58
정형     1.92
dtype: float64

In [12]:
# 인덱싱 & 슬라이싱
display(h["선영표"]) #출력 : 179
display(h[0]) #출력 : 179
display(h[["선영표","정봉균"]])
#출력:
# 선영표    179
# 정봉균    165
# dtype: int64
display(h[[0,3]])
#출력:
# 선영표    179
# 박병관    158
# dtype: int64



#자: 글자 슬라이싱도 가능
display(w["선영표":"박병관"]) #글자 슬라이싱은 끝 인덱싱을 포함
#출력:
# 선영표    60
# 정봉균    58
# 황해도    81
# 박병관    77
# Name: 몸무게, dtype: int64

#슬라이싱
display(w[1:4])# 숫자 슬라이싱은 끝 인덱스 직전까지 잘라온다
#출력:
# 정봉균    58
# 황해도    81
# 박병관    77
# Name: 몸무게, dtype: int64

179

179

선영표    179
정봉균    165
dtype: int64

선영표    179
박병관    158
dtype: int64

선영표    60
정봉균    58
황해도    81
박병관    77
Name: 몸무게, dtype: int64

정봉균    58
황해도    81
박병관    77
Name: 몸무게, dtype: int64

In [13]:
# boolean 색인
java = pd.Series({"선영표":90,"박병관":79,"정봉균":57,"정형":99})
java
#출력:
# 선영표    90
# 박병관    79
# 정봉균    57
# 정형     99
# dtype: int64

java[java <= 80]
#출력:
# 박병관    79
# 정봉균    57
# dtype: int64

박병관    79
정봉균    57
dtype: int64

In [14]:
#조건을 여러 개 넣고 싶은 경우 -> &(and), |(or) 연산자를 이용
java[(java >= 90)|(java <= 60)]
# 출력:
# 선영표    90
# 정봉균    57
# 정형     99
# dtype: int64

선영표    90
정봉균    57
정형     99
dtype: int64

#### 2. DataFrame 사용하기

In [15]:
# 생성 
df = pd.DataFrame([['선영표',160,56],
                   ['박병관',176,80],
                   ['정봉균',179, 76]])
df

     0    1   2
0  선영표  160  56
1  박병관  176  80
2  정봉균  179  76

In [16]:
#글자 인덱스를 부여해서 생성
df = pd.DataFrame([['선영표',160,56],
                   ['박병관',176,80],
                   ['정봉균',179, 76]],
                 index = ['1번','2번','3번'],
                 columns=['이름','키','몸무게'])
df

     이름    키  몸무게
1번  선영표  160   56
2번  박병관  176   80
3번  정봉균  179   76

In [17]:
# 속성
display(df.shape) # 모양 확인 #출력:(3, 3)
display(df.values) # numpy 배열로 값만 추출
#출력:
# array([['선영표', 160, 56],
#        ['박병관', 176, 80],
#        ['정봉균', 179, 76]], dtype=object)
display(df.index) #행인덱스 #출력:Index(['1번', '2번', '3번'], dtype='object')
display(df.columns) #열인덱스 #출력:Index(['이름', '키', '몸무게'], dtype='object')
display(df.dtypes) #각 열별로 데이터 타입 확인
#출력:
# 이름     object
# 키       int64
# 몸무게     int64
# dtype: object

(3, 3)

array([['선영표', 160, 56],
       ['박병관', 176, 80],
       ['정봉균', 179, 76]], dtype=object)

Index(['1번', '2번', '3번'], dtype='object')

Index(['이름', '키', '몸무게'], dtype='object')

이름     object
키       int64
몸무게     int64
dtype: object

In [18]:
# 연산 ->numpy 연산과 동일
df['몸무게'] / ((df['키']/100)**2)
#출력
# 1번    21.875000
# 2번    25.826446
# 3번    23.719609
# dtype: float64

1번    21.875000
2번    25.826446
3번    23.719609
dtype: float64

In [19]:
#indexing &  slicing
# 기본적으로 열 기준으로 색인하는 것을 우선시
display(df['몸무게'])
#출력
# 1번    56
# 2번    80
# 3번    76
# Name: 몸무게, dtype: int64


display(df[['몸무게','키']])

1번    56
2번    80
3번    76
Name: 몸무게, dtype: int64

    몸무게    키
1번   56  160
2번   80  176
3번   76  179

In [22]:
# 슬라이싱은 행 기준으로 동작
display(df["키":"몸무게"]) # 결과가 x
display(df["1번":"2번"]) #결과가 o

Empty DataFrame
Columns: [이름, 키, 몸무게]
Index: []

     이름    키  몸무게
1번  선영표  160   56
2번  박병관  176   80

20240214 수
20240215 목

In [23]:
#헷갈리는 걸 방지하기 위해 추천하는 인덱서
#iloc와 loc
display(df.loc[행,열]) # 글자와 숫자 모두 지원
display(df.iloc[행,열]) # 숫자만 지원

NameError: name '행' is not defined

In [34]:
#헷갈리는 걸 방지하기 위해 추천하는 인덱서
#iloc와 loc
display(df.loc['1번',"이름"])#글자와 숫자 모두 지원
#출력
#'선영표'

display(df.iloc[1,0])#글자와 숫자 모두 지원
#출력
#'박병관'

display(df.loc["2번","키":"몸무게"])
#출력
# 키      176
# 몸무게     80
# Name: 2번, dtype: object

display(df.iloc[0,0:2])
#출력:
# 이름    선영표
# 키     160
# Name: 1번, dtype: object

'선영표'

'박병관'

키      176
몸무게     80
Name: 2번, dtype: object

이름    선영표
키     160
Name: 1번, dtype: object

In [39]:
# boolean 색인
df[df['몸무게']<= 60]

     이름    키  몸무게
1번  선영표  160   56

In [45]:
#&, |
df[(df['키'] <= 160) | (df['키'] >= 178)]

     이름    키  몸무게
1번  선영표  160   56
3번  정봉균  179   76

#### 3. 유용한 함수

#### 3.1 기술통계관련

In [88]:
#데이터 로딩
score_df = pd.read_csv("./data/score.csv", encoding="euc=kr")
score_df

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26

In [70]:
# 과목별 평균 구하기

#쌤풀이
score_df.loc[:,'1반':'4반'].mean(axis=1)

#출력 =>시리즈
# 0    50.25
# 1    70.50
# 2    63.25
# 3    74.50
# 4    40.75
# dtype: float64

0    50.25
1    70.50
2    63.25
3    74.50
4    40.75
dtype: float64

In [89]:
# 원본 데이터프레임에 과목별 평균데이터 추가하기
score_df['과목별평균'] = score_df.loc[:,"1반":"4반"].mean(axis=1)
score_df

   과목  1반  2반  3반  4반  과목별평균
0  수학  45  44  73  39  50.25
1  영어  76  92  45  69  70.50
2  국어  47  92  45  69  63.25
3  사회  92  81  85  40  74.50
4  과학  11  79  47  26  40.75

In [90]:
# 원본 데이터프레임에 과목별 평균데이터 추가하기

#자영풀이(자영아 loc 잘  써라)
#쌤풀이
score_df['총합']= score_df.loc[:,"1반":"4반"].sum(axis=1)
score_df

   과목  1반  2반  3반  4반  과목별평균   총합
0  수학  45  44  73  39  50.25  201
1  영어  76  92  45  69  70.50  282
2  국어  47  92  45  69  63.25  253
3  사회  92  81  85  40  74.50  298
4  과학  11  79  47  26  40.75  163

In [91]:
# 반별평균 구하기
class_mean = score_df.iloc[0:5,1:5].mean()
class_mean
#출력
# 1반    54.2
# 2반    77.6
# 3반    59.0
# 4반    48.6
# dtype: float64

1반    54.2
2반    77.6
3반    59.0
4반    48.6
dtype: float64

In [97]:
#5번째 행인덱스에 반별평균 대입
score_df.loc[5] = class_mean

In [98]:
# 존재하지 않는 인덱스는 NaN을 넣어 결측치로 표시해준다.
score_df

    과목    1반    2반    3반    4반  과목별평균     총합
0   수학  45.0  44.0  73.0  39.0  50.25  201.0
1   영어  76.0  92.0  45.0  69.0  70.50  282.0
2   국어  47.0  92.0  45.0  69.0  63.25  253.0
3   사회  92.0  81.0  85.0  40.0  74.50  298.0
4   과학  11.0  79.0  47.0  26.0  40.75  163.0
5  NaN  54.2  77.6  59.0  48.6    NaN    NaN

#### 3.2 결측치 처리 함수
- 누락된 데이터를 대체값으로 채우는 경우
- 누락된 데이터를 포함한 행이나 열을 삭제

In [104]:
pop_df = pd.read_csv("./data/population_number.csv", encoding = 'euc-kr')
pop_df

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [107]:
# 누락된 데이터를 대체값으로 채우는 경우
pop_df.fillna(0)

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        0.0        0.0  3655437
2  인천  수도권  2890451  2632035.0        0.0  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [109]:
#복사본에 대해 작업을 해주는 함수들이 있기 때문에
# 대입을 해주거나
pop_df=pop_df.fillna(0)

In [111]:
#함수 속성 inplace 라는 속성을 True로 적용
pop_df.fillna(0, inplace=True)

In [113]:
pop_df

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        0.0        0.0  3655437
2  인천  수도권  2890451  2632035.0        0.0  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [118]:
# 기술통계 관련 함수를 이용해 대체값 채우기
pop_df = pd.read_csv("./data/population_number.csv", encoding = 'euc-kr')

#자:2010년 데이터의 결측치(NaN)을 2010년 데이터의 평균치로 채우자
pop_df['2010'].fillna(pop_df['2010'].mean())
#출력
# 0    9.631482e+06
# 1    4.898430e+06
# 2    2.632035e+06
# 3    2.431774e+06
# Name: 2010, dtype: float64

0    9.631482e+06
1    4.898430e+06
2    2.632035e+06
3    2.431774e+06
Name: 2010, dtype: float64

In [122]:
pop_df['2010']=pop_df['2010'].fillna(pop_df['2010'].mean())
pop_df

   도시   지역     2015          2010       2005     2000
0  서울  수도권  9904312  9.631482e+06  9762546.0  9853972
1  부산  경상권  3448737  4.898430e+06        NaN  3655437
2  인천  수도권  2890451  2.632035e+06        NaN  2466338
3  대구  경상권  2466052  2.431774e+06  2456016.0  2473990

In [127]:
pop_df['2005']=pop_df['2005'].fillna(pop_df['2005'].mean())
pop_df

   도시   지역     2015          2010       2005     2000
0  서울  수도권  9904312  9.631482e+06  9762546.0  9853972
1  부산  경상권  3448737  4.898430e+06  6109281.0  3655437
2  인천  수도권  2890451  2.632035e+06  6109281.0  2466338
3  대구  경상권  2466052  2.431774e+06  2456016.0  2473990

In [137]:
#누락된 데이터가 포함된 행 or 열을 삭제하기

pop_df = pd.read_csv("./data/population_number.csv", encoding = 'euc-kr')
pop_df.drop(["2010","2005"], axis=1, inplace=True) #inplace를 통해 원본에 적용
pop_df

   도시   지역     2015     2000
0  서울  수도권  9904312  9853972
1  부산  경상권  3448737  3655437
2  인천  수도권  2890451  2466338
3  대구  경상권  2466052  2473990

In [135]:
#특정 행이나 열을 지칭하지 않고 결측치가 존재하면 삭제하는 함수
pop_df = pd.read_csv("./data/population_number.csv", encoding = 'euc-kr')
pop_df.dropna(axis=1)

   도시   지역     2015     2000
0  서울  수도권  9904312  9853972
1  부산  경상권  3448737  3655437
2  인천  수도권  2890451  2466338
3  대구  경상권  2466052  2473990